<script setup></script>

<template>
  <section class="about-us-header">
    <div class="about-us-title"><h1>О нас</h1></div>
  </section>

  <section class="about-us-body">
    <div class="about-us-body-text">
      <p>
        KarinaRadi - это про индивидуальный стиль, про самовыражение, про желание быть яркой и
        особенной. Свободный крой-кимоно, комбинация разных фактуру и материалов - главная
        особенность Бренда.
      </p>
      <p>
        Мы за индивидуальность, поэтому стараемся создавать нетипичные изделия, которых ещё не
        видели на рынке. А образы - трансформеры являются неотъемлемой частью каждой нашей
        коллекции, у нас вы сможете найти: двусторонние блузы и платья, брюки и юбки с запахом,
        двусторонние куртки и плащи.. Каждый образ - это всегда 2-4 решения его использования.
      </p>
      <br />
      <div style="text-align: left" class="about-us-title">Миссия бренда</div>
      <br />
      <p>
        Главная миссия бренда - создание одежды , которую можно надеть на важное мероприятие , а
        после внедрить в повседневную жизнь, всегда выделяясь из толпы, цепляя взгляды прохожих.
      </p>
      <p>Ещё одной особенностью бренда является контраст фактур и цвета.</p>
      <p>
        Мы за индивидуальность и эксклюзив, поэтому все наши изделия создаются небольшими партиями.
      </p>
      <p>
        Одежда бренда имеет свободный крой, а длина изделий чаще всего достигает длины миди или
        макси.
      </p>
    </div>
    <div class="about-us-body-img">
      <img src="/img/about_us.png" />
    </div>
  </section>
</template>

<style scoped></style>
