<script setup></script>

<template>
  <footer class="footer">
    <div class="footer-menu">
      <div class="footer-section">
        <h4 class="accordion-header">Каталог</h4>
        <div class="accordion-content">
          <ul>
            <li><RouterLink to="/catalog">Весь каталог</RouterLink></li>
            <li><RouterLink to="/catalog/dresses">Платья</RouterLink></li>
            <li><RouterLink to="/catalog/suits">Костюмы</RouterLink></li>
          </ul>
        </div>
      </div>
      <div class="footer-section">
        <h4 class="accordion-header">Покупателям</h4>
        <div class="accordion-content">
          <ul>
            <li>
              <RouterLink to="/refunds">Условия обмена и возврата</RouterLink>
            </li>
            <li>
              <RouterLink to="/delivery">Доставка</RouterLink>
            </li>
            <li>
              <RouterLink to="/about">О нас</RouterLink>
            </li>
          </ul>
        </div>
      </div>
      <div class="footer-section newsletter">
        <h4 class="accordion-header">Прочее</h4>
        <div class="accordion-content">
          <ul>
            <li>
              <RouterLink to="/offer">Публичная оферта</RouterLink>
            </li>
          </ul>
        </div>
        <div class="newsletter-header">
          <h4>Подписаться на рассылку</h4>
        </div>

        <div class="newsletter-form">
          <input type="email" placeholder="Введите ваш email" />
          <button>Отправить</button>
        </div>
        <div class="newsletter-consent">
          Нажимая кнопку «Отправить», вы даёте согласие на рекламную рассылку и обработку
          персональных данных в соответствии с правилами.
        </div>
        <div class="socials">
          <a href="/">
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="28"
              height="28"
              viewBox="0 0 28 28"
              fill="none"
            >
              <path
                d="M20.4942 1.35632H7.85053C4.35907 1.35632 1.52869 4.18671 1.52869 7.67816V20.3218C1.52869 23.8133 4.35907 26.6437 7.85053 26.6437H20.4942C23.9857 26.6437 26.816 23.8133 26.816 20.3218V7.67816C26.816 4.18671 23.9857 1.35632 20.4942 1.35632Z"
                stroke="white"
                stroke-width="1.89655"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
              <path
                d="M21.1264 7.04602H21.139M19.2298 13.2035C19.3858 14.2558 19.2061 15.3304 18.7162 16.2747C18.2262 17.2189 17.451 17.9846 16.5008 18.4628C15.5506 18.9411 14.4738 19.1076 13.4236 18.9386C12.3733 18.7696 11.4031 18.2737 10.6509 17.5215C9.89866 16.7693 9.40279 15.7991 9.23379 14.7488C9.06479 13.6986 9.23126 12.6217 9.70952 11.6716C10.1878 10.7214 10.9535 9.94615 11.8977 9.45621C12.8419 8.96627 13.9166 8.78653 14.9689 8.94257C16.0422 9.10174 17.0359 9.60189 17.8032 10.3692C18.5705 11.1364 19.0706 12.1301 19.2298 13.2035Z"
                stroke="white"
                stroke-width="2.52874"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
            </svg>
          </a>
          <a href="/">
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="32"
              height="32"
              viewBox="0 0 32 32"
              fill="none"
            >
              <path
                d="M24.8104 7.0357C23.6511 5.86503 22.2703 4.93681 20.7486 4.30513C19.227 3.67344 17.5948 3.35093 15.9472 3.35639C9.04375 3.35639 3.41731 8.98283 3.41731 15.8863C3.41731 18.0989 3.99892 20.2483 5.08628 22.1449L3.31616 28.6437L9.95409 26.8989C11.7874 27.8978 13.8483 28.4288 15.9472 28.4288C22.8506 28.4288 28.4771 22.8024 28.4771 15.8989C28.4771 12.5483 27.1748 9.40007 24.8104 7.0357ZM15.9472 26.3047C14.0759 26.3047 12.2426 25.7989 10.6369 24.8506L10.2575 24.6231L6.31271 25.6598L7.36214 21.8162L7.10927 21.4242C6.06938 19.7642 5.51733 17.8451 5.51616 15.8863C5.51616 10.146 10.1943 5.46789 15.9346 5.46789C18.7162 5.46789 21.3334 6.55524 23.2932 8.52766C24.2637 9.49346 25.0328 10.6424 25.5559 11.9077C26.079 13.1731 26.3456 14.5297 26.3403 15.8989C26.3656 21.6392 21.6874 26.3047 15.9472 26.3047ZM21.6621 18.5162C21.346 18.3644 19.8035 17.6058 19.5254 17.492C19.2346 17.3909 19.0323 17.3403 18.8173 17.6437C18.6024 17.9598 18.0081 18.6679 17.8311 18.8702C17.6541 19.0851 17.4644 19.1104 17.1483 18.946C16.8323 18.7943 15.8208 18.4529 14.6323 17.3909C13.6966 16.5564 13.0771 15.5323 12.8874 15.2162C12.7104 14.9001 12.8621 14.7357 13.0265 14.5713C13.1656 14.4323 13.3426 14.2047 13.4943 14.0277C13.646 13.8506 13.7093 13.7116 13.8104 13.5093C13.9116 13.2943 13.861 13.1173 13.7851 12.9656C13.7093 12.8139 13.0771 11.2713 12.8242 10.6392C12.5713 10.0323 12.3058 10.1081 12.1162 10.0955H11.5093C11.2943 10.0955 10.9656 10.1713 10.6748 10.4874C10.3966 10.8035 9.58743 11.5621 9.58743 13.1047C9.58743 14.6472 10.7127 16.1392 10.8644 16.3414C11.0162 16.5564 13.0771 19.7173 16.2127 21.0702C16.9587 21.3989 17.5403 21.5886 17.9955 21.7277C18.7414 21.9679 19.4242 21.93 19.9679 21.8541C20.5748 21.7656 21.8265 21.0955 22.0794 20.3621C22.3449 19.6288 22.3449 19.0093 22.2564 18.8702C22.1679 18.7311 21.9782 18.6679 21.6621 18.5162Z"
                fill="white"
              />
            </svg>
          </a>
          <a href="/">
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="27"
              height="27"
              viewBox="0 0 27 27"
              fill="none"
            >
              <g clip-path="url(#clip0_154_768)">
                <path
                  d="M26.1149 2.74707L1.33325 11.5976L8.41371 15.1379L19.0344 8.05742L11.9539 16.908L22.5746 23.9884L26.1149 2.74707Z"
                  stroke="white"
                  stroke-width="1.89655"
                  stroke-linejoin="round"
                />
              </g>
              <defs>
                <clipPath id="clip0_154_768">
                  <rect
                    width="26.5517"
                    height="26.5517"
                    fill="white"
                    transform="translate(0.448242 0.0919189)"
                  />
                </clipPath>
              </defs>
            </svg>
          </a>
        </div>
      </div>
    </div>
    <div class="footer-logo-desktop">Karinaradi</div>
    <div class="footer-logo-mobile">KR</div>
  </footer>
</template>

<style scoped></style>
